### Pandas must known 10 function

In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {'age': [25, 22, 18, 30, 45, 50, 35, 20, 55, 40],
        'gender': ['M', 'F', 'F', 'M', 'M', 'F', 'M', 'F', 'M', 'M'],
        'score': [90, 80, 75, 95, 70, 85, 75, 90, 95, 85]}
df = pd.DataFrame(data)
df

   age gender  score
0   25      M     90
1   22      F     80
2   18      F     75
3   30      M     95
4   45      M     70
5   50      F     85
6   35      M     75
7   20      F     90
8   55      M     95
9   40      M     85

#### 1. value_counts()
###### The value_counts() method in Pandas is used to obtain a Series containing counts of unique values.

In [4]:
print(df["gender"].value_counts())

gender
M    6
F    4
Name: count, dtype: int64

In [5]:
# normalize means related frequency of each value 
print(df["gender"].value_counts(normalize=True))

gender
M    0.6
F    0.4
Name: proportion, dtype: float64

#### 2. where()
###### The where() method in Pandas is used to replace values in a DataFrame or Series based on a condition. It acts like an if-then statement, where if the condition is true, the original value is kept; otherwise, it's replaced with a specified value

In [26]:
print("where function : \n",
      df.where(df["age"] > 30))

# we can set non - matching values to another value 
print("where function with other conditions : \n",
      df.where(df["age"] > 30, other="<30"))

print("where function with other rows displays nothing  : \n",
      df[df.where(df['age']>30,other=0).all(1)])

where function :
     age gender  score
0   NaN    NaN    NaN
1   NaN    NaN    NaN
2   NaN    NaN    NaN
3   NaN    NaN    NaN
4  45.0      M   70.0
5  50.0      F   85.0
6  35.0      M   75.0
7   NaN    NaN    NaN
8  55.0      M   95.0
9  40.0      M   85.0
where function with other conditions :
    age gender score
0  <30    <30   <30
1  <30    <30   <30
2  <30    <30   <30
3  <30    <30   <30
4   45      M    70
5   50      F    85
6   35      M    75
7  <30    <30   <30
8   55      M    95
9   40      M    85
where function with other rows displays nothing  :
    age gender  score
4   45      M     70
5   50      F     85
6   35      M     75
8   55      M     95
9   40      M     85

#### 3. isin()
###### The isin() method in Pandas is used to check if elements in a DataFrame or Series are present in a list-like object (list, Series, or another DataFrame). It returns a boolean DataFrame or Series of the same shape, indicating where the match is True and not match is False

In [37]:
# isin() for single column
# df[df["age"].isin([25,35])]


# isin() multiple columns
print(df[df[["age","gender"]].isin({ "age" : [25,35], "gender" : ["M"]}).all(1)])

   age gender  score
0   25      M     90
6   35      M     75

#### 4. cut() and qcut()
###### cut():
###### This function divides the data into bins of equal width. The user can specify the number of bins or the bin edges. If the number of bins is specified, pandas will calculate the bin edges automatically.
###### qcut():
###### This function divides the data into bins of equal frequency. The user specifies the number of bins, and pandas determines the bin edges such that each bin contains the same number of data points.

In [46]:
# df["score_bins"] = pd.cut(df["score"], bins = [60,70,80,90,100])
# print(df)

# print(" in this (80,90] so ( ==> is exclusive and ] ==> is inclusive ")

# labels for bins
# score_labels = ["Very low", "low", "Medium","High", "Very High"]
# df["score_bins"] = pd.cut(df["score"], bins = [60,70,80,90,100], labels = score_labels)
# print(df)


bin_names = ['Very low','low','medium','high','very high']
df['score_bins']=pd.cut(df['score'],bins=[60,70,80,85,90,100],labels=bin_names)

print(df)

   age gender  score score_bins
0   25      M     90       high
1   22      F     80        low
2   18      F     75        low
3   30      M     95  very high
4   45      M     70   Very low
5   50      F     85     medium
6   35      M     75        low
7   20      F     90       high
8   55      M     95  very high
9   40      M     85     medium

In [49]:
# q  cut
# divides a continuous variable into set of discrete bins based on the qauntiles.
#  qauntiles are the values that divide a data set into a specified number of equal parts

df
age_bins = pd.qcut(df["age"],4)

In [50]:
age_bins

0      (22.75, 32.5]
1    (17.999, 22.75]
2    (17.999, 22.75]
3      (22.75, 32.5]
4      (43.75, 55.0]
5      (43.75, 55.0]
6      (32.5, 43.75]
7    (17.999, 22.75]
8      (43.75, 55.0]
9      (32.5, 43.75]
Name: age, dtype: category
Categories (4, interval[float64, right]): [(17.999, 22.75] < (22.75, 32.5] < (32.5, 43.75] < (43.75, 55.0]]

In [52]:
# labels
df["age_bins"] = pd.qcut(df["age"],4 , labels = ["Young", "mid-young", "mid-adult","senior"] )
df

   age gender  score score_bins   age_bins
0   25      M     90       high  mid-young
1   22      F     80        low      Young
2   18      F     75        low      Young
3   30      M     95  very high  mid-young
4   45      M     70   Very low     senior
5   50      F     85     medium     senior
6   35      M     75        low  mid-adult
7   20      F     90       high      Young
8   55      M     95  very high     senior
9   40      M     85     medium  mid-adult

#### Group by

In [54]:
data_g = {'age': [25, 22, 18, 30, 45, 50, 35, 20, 55, 40],
        'gender': ['M', 'F', 'F', 'M', 'M', 'F', 'M', 'F', 'M', 'M'],
        'score': [90, 80, 75, 95, 70, 85, 75, 90, 95, 85]}
df_g = pd.DataFrame(data_g)

In [55]:
grouped = df_g.groupby("gender")
grouped

In [56]:
grouped["score"].mean()

gender
F    82.5
M    85.0
Name: score, dtype: float64

In [57]:
df_g.groupby("gender")["score"].mean()

gender
F    82.5
M    85.0
Name: score, dtype: float64

In [58]:
#mean,sum,count for the score column for each grp
grouped["score"].agg(["mean", "sum","count"])

        mean  sum  count
gender
F       82.5  330      4
M       85.0  510      6

In [59]:
df_g.groupby("gender").agg({"age" : "max", "score" : "mean"})

        age  score
gender
F        50   82.5
M        55   85.0

#### 6. Pivot table 
###### Pivot tables in pandas are used to reshape and aggregate data, similar to pivot tables in spreadsheet software. They allow for summarizing data in a structured format, making it easier to analyze and extract insights. The pivot_table() function is the primary tool for creating these tables.

###### import pandas as pd

###### pd.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False, sort=True)
###### data: DataFrame to be used.
###### values: Column to aggregate.
###### index: Column(s) to group by on the rows.
###### columns: Column(s) to group by on the columns.
###### aggfunc: Aggregation function (e.g., 'mean', 'sum', 'count').
###### fill_value: Value to replace missing values.
###### margins: Add subtotals and grand totals.
###### dropna: Drop columns with all NaN values.
###### margins_name: Name for margin rows and columns.
###### observed: Show only observed values for categorical groupers.
###### sort: Sort the result.

In [61]:
# table that grps the data by the gender column 
# and calculates the mean of score column 


df_g.pivot_table(index = "gender",
                 values = "score",
                 aggfunc= "mean")

        score
gender
F        82.5
M        85.0

In [68]:
df_g.pivot_table(index = ["gender"],
                 values = ["age", "score"],
                 aggfunc= ["sum","mean","count","max","min"])

        sum             mean       count       max       min
        age score        age score   age score age score age score
gender
F       110   330  27.500000  82.5     4     4  50    90  18    75
M       230   510  38.333333  85.0     6     6  55    95  25    70

##### Nlargest and Nsmallest

###### nlargest(n, columns, keep='first')
###### Returns the first n rows with the largest values in the specified column(s), in descending order. 
###### n: Number of top rows to retrieve.
###### columns: Column name(s) to order by.
###### keep: Specifies how to handle duplicate values (ties):
######          'first' (default): Prioritize the first occurrence(s).
######          'last': Prioritize the last occurrence(s).
######          'all': Keep all occurrences, even if it results in more than n rows.

In [71]:
df_g["score"].nlargest(3)

df_g.nlargest(3,"score")

   age gender  score
3   30      M     95
8   55      M     95
0   25      M     90

In [73]:
df_g["score"].nsmallest(3)

df_g.nsmallest(3,"score")

   age gender  score
4   45      M     70
2   18      F     75
6   35      M     75

#### 8. Query

In [77]:
df_g.query("age>25 and gender=='F'")

   age gender  score
5   50      F     85

##### 9. sort_values

In [79]:
df_g.sort_values(by="age",ascending=False)
df_g.sort_values(by="age",ascending=True)

   age gender  score
2   18      F     75
7   20      F     90
1   22      F     80
0   25      M     90
3   30      M     95
6   35      M     75
9   40      M     85
4   45      M     70
5   50      F     85
8   55      M     95

#### 10. apply()

In [83]:
# values of gender column in lower case so 
df["gender"].apply(str.lower)

df["age"].apply(lambda x : x**2)

0     625
1     484
2     324
3     900
4    2025
5    2500
6    1225
7     400
8    3025
9    1600
Name: age, dtype: int64

In [84]:
def age(x):
    return x**2

In [85]:
df["age"].apply(age)

0     625
1     484
2     324
3     900
4    2025
5    2500
6    1225
7     400
8    3025
9    1600
Name: age, dtype: int64